blogs/the-story-of-one-latency-spike.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-10 日 23:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>一次延迟尖峰的故事</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">一次延迟尖峰的故事</h1>
<p>
本文是<a href="https://blog.cloudflare.com/the-story-of-one-latency-spike/">The story of one latency spike</a>的阅读笔记。
</p>

<p>
CloudFlare的CDN客户反馈有些HTTP请求非常慢，在30s+。
</p>

<div id="outline-container-orge35f7f2" class="outline-2">
<h2 id="orge35f7f2"><span class="section-number-2">1</span> 复现问题</h2>
<div class="outline-text-2" id="text-1">
<p>
CloudFlare复现了这个问题，在数千请求中有的请求耗时1s。在网络中1s、30s有特殊含义，它们是SYN包重传的间隔。
</p>
</div>
</div>

<div id="outline-container-org4502558" class="outline-2">
<h2 id="org4502558"><span class="section-number-2">2</span> 网络问题吗</h2>
<div class="outline-text-2" id="text-2">
<p>
用于测试的网络拓扑： <code>Test machine -&gt; Internet -&gt; Router -&gt; Server</code> 。这里使用ping测试。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">目标</th>
<th scope="col" class="org-left">avg RTT</th>
<th scope="col" class="org-left">max RTT</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Router</td>
<td class="org-left">11ms</td>
<td class="org-left">122ms</td>
</tr>

<tr>
<td class="org-left">Server</td>
<td class="org-left">11ms</td>
<td class="org-left">1868ms</td>
</tr>
</tbody>
</table>

<p>
可能是Server的问题，也可能是Router-&gt;Server网络的问题。
</p>
</div>
</div>

<div id="outline-container-org48e8c6b" class="outline-2">
<h2 id="org48e8c6b"><span class="section-number-2">3</span> TCPDUMP</h2>
<div class="outline-text-2" id="text-3">
<p>
在Server上使用 <code>tcpdump -ttt -n -i eth2 icmp</code> 可以清楚看到，ping请求的request和reply的间隔大于1s。这说明是Server的问题，内核遇到了麻烦。
</p>
</div>
</div>

<div id="outline-container-org6457fd0" class="outline-2">
<h2 id="org6457fd0"><span class="section-number-2">4</span> 寻找根因</h2>
<div class="outline-text-2" id="text-4">
<p>
Linux 的 <code>net_rx_action</code> 函数负责处理网络收包软中断，跟踪它的延迟，发现几乎所有包都在1ms内处理完毕，但是也有23ms的长尾，23ms对于底层包处理是灾难性的，可能导致buffer耗尽、开始丢包。需要下钻 <code>net_rx_action</code> ，寻找根因。下钻的方法是：
</p>

<ol class="org-ol">
<li>火焰图，如果能找到包含 <code>net_rx_action</code> 的栈上有明显热点，问题解决（适合OnCPU原因引发的慢）;</li>
<li>如果不明显，对火焰图中 <code>net_rx_action</code> 栈上的函数，分别度量其延迟（比较通用，但是OffCPU引发的慢，可能火焰图上看不到）。</li>
</ol>

<p>
最终定位到 <code>tcp_collapse</code> ，平均耗时3ms，最大21ms。
</p>
</div>
</div>

<div id="outline-container-org265e57f" class="outline-2">
<h2 id="org265e57f"><span class="section-number-2">5</span> TCP collapse</h2>
<div class="outline-text-2" id="text-5">
<p>
Linux的receive buffer size用于限制TCP socket可用的接收缓冲大小。这个buffer不仅包含TCP数据，也包含管理TCP数据的元数据（ <code>sk_buffer</code> 240byte）。对于小包，元数据的内存消耗非常可观。当receive内存不足时，就会发生TCP collapse。
</p>

<p>
TCP collapse合并<code>sk_buffer</code> ，让一个 <code>sk_buffer</code> 包含更多的TCP数据，减少元数据的开销。这个过程和 <code>sk_buffer</code> 的数量有关，也即和receive buffer大小有关。
</p>

<p>
调整 <code>net.ipv4.tcp_rmem</code> 参数，从 <code>4096 5242880 33554432</code> 到 <code>4096 1048576 2097152</code> ，receive buffer的最大大小从32M降低到2M， <code>tcp_collapse</code> 的最大耗时降低到3ms。
</p>
</div>
</div>

<div id="outline-container-org96c4e65" class="outline-2">
<h2 id="org96c4e65"><span class="section-number-2">6</span> 总结</h2>
<div class="outline-text-2" id="text-6">
<p>
降低 receive buffer的大小，影响高吞吐、高延迟的连接。CloudFlare做了折中，设置为4M。
</p>
</div>
</div>

<div id="outline-container-orgfff2b86" class="outline-2">
<h2 id="orgfff2b86"><span class="section-number-2">7</span> 我的思考</h2>
<div class="outline-text-2" id="text-7">
<p>
调整receive buffer似乎没有解决根因，为什么receive buffer会满？是不是业务进程消费不足，导致请求积压？
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2023-09-10 日 23:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
